#  Reading and Writing Data in Text Format

## Table 6-1. Text and binary data loading functions in pandas

| Function        | Description                                                                 | Example (Python) |
|-----------------|-----------------------------------------------------------------------------|------------------|
| `read_csv`      | Load delimited data from a file, URL, or file-like object; comma is default delimiter | `pd.read_csv("data.csv")` |
| `read_fwf`      | Read data in fixed-width column format (no delimiters)                      | `pd.read_fwf("data.txt")` |
| `read_clipboard`| Variation of `read_csv` that reads data from the clipboard; useful for converting tables from web pages | `pd.read_clipboard()` |
| `read_excel`    | Read tabular data from an Excel XLS or XLSX file                            | `pd.read_excel("data.xlsx")` |
| `read_hdf`      | Read HDF5 files written by pandas                                           | `pd.read_hdf("data.h5")` |
| `read_html`     | Read all tables found in the given HTML document                            | `pd.read_html("page.html")` |
| `read_json`     | Read data from a JSON string, file, URL, or file-like object                | `pd.read_json("data.json")` |
| `read_feather`  | Read the Feather binary file format                                         | `pd.read_feather("data.feather")` |
| `read_orc`      | Read the Apache ORC binary file format                                      | `pd.read_orc("data.orc")` |
| `read_parquet`  | Read the Apache Parquet binary file format                                  | `pd.read_parquet("data.parquet")` |
| `read_pickle`   | Read an object stored by pandas using the Python pickle format              | `pd.read_pickle("data.pkl")` |
| `read_sas`      | Read a SAS dataset stored in SAS system’s custom storage formats            | `pd.read_sas("data.sas7bdat")` |
| `read_spss`     | Read a data file created by SPSS                                            | `pd.read_spss("data.sav")` |
| `read_sql`      | Read the results of a SQL query (using SQLAlchemy)                         | `pd.read_sql("SELECT * FROM table", con)` |
| `read_sql_table`| Read a whole SQL table (using SQLAlchemy); equivalent to selecting everything with `read_sql` | `pd.read_sql_table("table_name", con)` |
| `read_stata`    | Read a dataset from Stata file format                                       | `pd.read_stata("data.dta")` |
| `read_xml`      | Read a table of data from an XML file                                       | `pd.read_xml("data.xml")` |

In [2]:
!type "examples\\ex1.csv"

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("examples\\ex1.csv")

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!type "examples\\ex2.csv"

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv("examples\\ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv("examples\\ex2.csv",names=["a","b","c","d","message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names=["a","b","c","d","message"]

In [10]:
pd.read_csv("examples\\ex2.csv",names=names,index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!type "examples\\csv_mindex.csv"

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed=pd.read_csv("examples\\csv_mindex.csv",index_col=["key1","key2"])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
!type "examples\\ex3.txt"

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
result=pd.read_csv("examples\\ex3.txt",sep="\\s+")

In [16]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
!type "examples\\ex4.csv"

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv("examples\\ex4.csv",skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!type "examples\\ex5.csv"

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [20]:
result=pd.read_csv("examples\\ex5.csv")

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [23]:
result=pd.read_csv("examples\\ex5.csv",na_values=["NULL"])

In [24]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
result2=pd.read_csv("examples\\ex5.csv",keep_default_na=False)

In [26]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [27]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [28]:
result3=pd.read_csv("examples\\ex5.csv",keep_default_na=False,na_values=["NA"])

In [29]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [30]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [31]:
sentinels={
    "message":["foo","NA"],
    "something":["two"]
}

In [32]:
pd.read_csv("examples\\ex5.csv",na_values=sentinels,keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Arguments for `pandas.read_csv`

| Argument        | Description                                                                 |
|-----------------|-----------------------------------------------------------------------------|
| `path`          | String indicating filesystem location, URL, or file-like object.            |
| `sep` / `delimiter` | Character sequence or regex to split fields in each row. Default is comma (`,`). |
| `header`        | Row number to use as column names; defaults to `0` (first row). Use `None` if no header row. |
| `index_col`     | Column numbers or names to use as the row index; can be single or list (for MultiIndex). |
| `names`         | List of column names for result.                                            |
| `skiprows`      | Number of rows at beginning to ignore, or list of row numbers to skip.      |
| `na_values`     | Sequence of values to replace with NA. Added to default list unless `keep_default_na=False`. |
| `keep_default_na` | Whether to use the default NA value list (`True` by default).             |
| `comment`       | Character(s) to split comments off the end of lines.                        |
| `parse_dates`   | Attempt to parse data to datetime (`False` by default). Can be `True`, list of columns, or list of tuples for combined parsing. |
| `keep_date_col` | If joining columns to parse date, keep the joined columns (`False` by default). |
| `converters`    | Dict mapping column number or name to functions (e.g., `{"foo": f}`).       |
| `dayfirst`      | Treat ambiguous dates as international format (e.g., `7/6/2012 → June 7`). Default `False`. |
| `date_parser`   | Function to use to parse dates.                                             |
| `nrows`         | Number of rows to read from beginning (excluding header).                   |
| `iterator`      | Return a `TextFileReader` object for piecemeal reading.                     |
| `chunksize`     | For iteration, size of file chunks.                                         |
| `skip_footer`   | Number of lines to ignore at end of file.                                   |
| `verbose`       | Print parsing info (time spent, memory use).                                |
| `encoding`      | Text encoding (e.g., `"utf-8"`). Default is `"utf-8"`.                      |
| `squeeze`       | If parsed data has only one column, return a Series.                       |
| `thousands`     | Separator for thousands (e.g., `","` or `"."`). Default `None`.             |
| `decimal`       | Decimal separator in numbers (default `"."`).                              |
| `engine`        | CSV parsing engine: `"c"` (default), `"python"`, or `"pyarrow"`.            |

# Reading Text Files in Pieces

In [33]:
pd.options.display.max_rows=10

In [34]:
result=pd.read_csv("examples\\ex6.csv")

In [35]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [36]:
pd.read_csv("examples\\ex6.csv",nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [37]:
chunker=pd.read_csv("examples\\ex6.csv",chunksize=1000)

In [38]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [39]:
chunker=pd.read_csv("examples\\ex6.csv",chunksize=1000)

In [40]:
tot=pd.Series([],dtype="int64")
for piece in chunker:
    tot=tot.add(piece["key"].value_counts(),fill_value=0)
    
tot=tot.sort_values(ascending=False)

In [41]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

# Writing Data to Text Format

In [42]:
data=pd.read_csv("examples/ex5.csv")

In [43]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv("examples/out.csv")

In [45]:
!type "examples\out.csv"

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [46]:
import sys

In [47]:
data.to_csv(sys.stdout,sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [48]:
data.to_csv(sys.stdout,na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout,index=False,columns=["a","b","c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [51]:
temp=pd.read_csv("examples\\ex7.csv")
temp

   a  b  c
0  1  2  3
1  1  2  3

In [52]:
!type "examples\ex7.csv"

"a","b","c"
"1","2","3"
"1","2","3"

In [53]:
import csv

In [54]:
f=open("examples/ex7.csv")

In [55]:
reader=csv.reader(f)

In [56]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [57]:
f.close()

In [58]:
with open("examples/ex7.csv") as f:
    lines=list(csv.reader(f))

In [59]:
header,values=lines[0],lines[1:]

In [60]:
data_dict={h: v for h, v in zip(header,zip(*values))}

In [61]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [62]:
class my_dialect(csv.Dialect):
    lineterminator="\n"
    delimiter=";"
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL
    
reader=csv.reader(f,dialect=my_dialect)

ValueError: I/O operation on closed file.

In [ ]:
reader=csv.reader(f,dialect=my_dialect)

ValueError: I/O operation on closed file.

# JSON Data

In [ ]:
import json

In [ ]:
obj = """
{"name": "Wes",
"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
{"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [ ]:
result=json.loads(obj)

In [ ]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [ ]:
asjson=json.dumps(result)

In [ ]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [ ]:
siblings=pd.DataFrame(result["siblings"],columns=["name","age"])

In [ ]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [ ]:
!type "examples\example.json"

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [ ]:
data=pd.read_json("examples\\example.json")

In [ ]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [ ]:
data.to_json(sys.stdout,orient="records") #means each row of the DataFrame will be converted into a dictionary, and the final output will be a list of these dictionaries.

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

# XML and HTML: Web Scraping

In [ ]:
tables=pd.read_html("examples\\fdic_failed_bank_list.html")

In [ ]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [ ]:
len(tables)

1

In [ ]:
failures=tables[0] #the first table (a DataFrame).

In [ ]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [ ]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [ ]:
close_timestamps=pd.to_datetime(failures["Closing Date"])

In [ ]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [ ]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

# Parsing XML with lxml.objectify

In [ ]:
from lxml import objectify

In [ ]:
path="datasets\\mta_perf\\Performance_MNR.xml"

In [ ]:
with open(path) as f:
    parsed=objectify.parse(f)

In [ ]:
root=parsed.getroot()

In [ ]:
data = []   # Start with an empty list to collect results

skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]
# These are XML tags you want to ignore

for elt in root.INDICATOR:   # Iterate over each <INDICATOR> element in the XML tree
    el_data = {}             # Create a dictionary to hold this element's data
    
    for child in elt.getchildren():   # Loop through all child nodes of <INDICATOR>
        if child.tag in skip_fields:  # Skip unwanted tags
            continue
        el_data[child.tag] = child.pyval   # Store tag name as key, its value as dictionary value
    
    data.append(el_data)   # Add the dictionary to the list

In [ ]:
perf=pd.DataFrame(data)

In [ ]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [ ]:
perf.shape

(648, 12)

In [ ]:
perf2=pd.read_xml(path)

In [ ]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [ ]:
perf2.shape

(648, 16)

# 6.2 Binary Data Formats

In [ ]:
frame=pd.read_csv("examples\\ex1.csv")

In [ ]:
frame.to_pickle("examples\\frame_pickle1")

In [ ]:
pd.read_pickle("examples\\frame_pickle1")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [63]:
# Use fastparquet engine to avoid pyarrow extension type conflict

fec = pd.read_parquet("datasets\\fec\\fec.parquet", engine="fastparquet")

In [64]:
fec

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250.0,20-JUN-11,None,None,None,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50.0,23-JUN-11,None,None,None,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,05-JUL-11,None,None,None,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250.0,01-AUG-11,None,None,None,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300.0,20-JUN-11,None,None,None,SA17A,736166
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1001726,C00500587,P20003281,"Perry, Rick","GORMAN, CHRIS D. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,5000.0,29-SEP-11,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,None,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,SA17A,751678
1001727,C00500587,P20003281,"Perry, Rick","DUFFY, DAVID A. MR.",INFO REQUESTED,XX,99999,DUFFY EQUIPMENT COMPANY INC.,BUSINESS OWNER,2500.0,30-SEP-11,None,None,None,SA17A,751678
1001728,C00500587,P20003281,"Perry, Rick","GRANE, BRYAN F. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,29-SEP-11,None,None,None,SA17A,751678
1001729,C00500587,P20003281,"Perry, Rick","TOLBERT, DARYL MR.",INFO REQUESTED,XX,99999,T.A.C.C.,LONGWALL MAINTENANCE FOREMAN,500.0,30-SEP-11,None,None,None,SA17A,751678
1001730,C00500587,P20003281,"Perry, Rick","ANDERSON, MARILEE MRS.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,31-AUG-11,None,None,None,SA17A,751678

# Reading Microsoft Excel Files

In [65]:
xlsx=pd.ExcelFile("examples\\ex1.xlsx")

In [66]:
xlsx

In [67]:
xlsx.sheet_names

['Sheet1']

In [68]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [73]:
xlsx.parse(sheet_name="Sheet1",index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [74]:
frame=pd.read_excel("examples\\ex1.xlsx",sheet_name="Sheet1")

In [75]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [91]:
writer=pd.ExcelWriter("examples\\ex2.xlsx")

In [92]:
frame.to_excel(writer,"Sheet1")

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_44188\1563361520.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer,"Sheet1")

In [94]:
writer.close()

In [95]:
frame.to_excel("examples\\ex2.xlsx")

In [96]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

# Using HDF5 Format

# 6.3 Interacting with Web APIs

In [97]:
import requests

In [98]:
url="https://api.github.com/repos/pandas-dev/pandas/issues"

In [99]:
resp=requests.get(url)

In [106]:
resp.raise_for_status()
# Raise an HTTPError if the response returned an unsuccessful status code (4xx or 5xx).

In [107]:
resp

In [108]:
data=resp.json()

In [109]:
data[0]["title"]

'ENH: Delegate datetime properties for PyArrow-backed Index'

In [110]:
issues=pd.DataFrame(
    data,
    columns=[
        "number",
        "title",
        "labels",
        "state"
    ]
)

In [111]:
issues

,number,title,labels,state
0,63607,ENH: Delegate datetime properties for PyArrow-...,[],open
1,63605,DOC: Inline docstring for PyxlsbReader.__init_...,[],open
2,63603,"ENH: stock_board_industry_name_em() be better,...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",closed
3,63602,PERF: use Arrow native path for str.partition ...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
4,63601,CLN: Enable ruff rule PLR1733 (unnecessary-dic...,[],open
...,...,...,...,...
25,63530,ENH: Add opt-in diagnostics report,[],open
26,63529,feat: Add fix to pyarrow,[],open
27,63527,BUG: PyArrow-backed datetime index missing num...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,63526,BUG: `.loc` slicing fails on PyArrow-backed da...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,63524,DOC: clarify note about optimized indexing met...,[],open

# 6.4 Interacting with Databases

In [112]:
import sqlite3

In [119]:
query="""
CREATE TABLE test(
    a VARCHAR(20),
    b VARCHAR(20),
    c REAL,
    d INTEGER
);
"""

In [120]:
conn=sqlite3.connect("mydata.sqlite")

In [121]:
conn.execute(query)

In [123]:
conn.commit()

In [124]:
data=[
    ("one","two",3.0,4),
    ("five","six",7.0,8)
]

In [125]:
stmt="INSERT INTO test VALUES(?,?,?,?)"

In [127]:
conn.executemany(stmt,data)

In [129]:
conn.commit()

In [131]:
cursor=conn.execute("SELECT * FROM test")

In [132]:
rows=cursor.fetchall()

In [133]:
rows

[('one', 'two', 3.0, 4), ('five', 'six', 7.0, 8)]

In [134]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [135]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

      a    b    c  d
0   one  two  3.0  4
1  five  six  7.0  8

In [143]:
import sqlalchemy as sqla

In [144]:
db=sqla.create_engine("sqlite:///mydata.sqlite")

In [146]:
pd.read_sql("SELECT * FROM test", db)

C:\Users\Prathamesh Gawas\AppData\Local\Temp\ipykernel_44188\2418419172.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM test", db)

AttributeError: 'Engine' object has no attribute 'cursor'